#=== CONSTANT ==============================================================================#
	{MODX_CORE_PATH} - абсолютный путь к ядру (оканчивается /CORE/)
	{MODX_ASSETS_PATH} - абсолютный путь к активам (оканчивается /assets/)
	{MODX_PROCESSORS_PATH} - абсолютный путь к процессорам (оканчивается /processors/)
	{MODX_CONNECTORS_PATH} - абсолютный путь к коннекторам (оканчивается /connectors/)
	{MODX_MANAGER_PATH} - абсолютный путь к админ части (оканчивается /manager/)
	{MODX_BASE_PATH} - абсолютный путь к корню сайта, обчно то же самое, что и $_SERVER['DOCUMENT_ROOT']
	{MODX_HTTP_HOST} - имя сайта (домен)
#=== CONSTANT ==============================================================================#
#=== OPTIONS ===============================================================================#
	{$modx->getOption('server_protocol')} - протокол (http | https)
	{$modx->getOption('site_url')} - адрес сайта
	{$modx->getOption('http_host')} - хост
	{$modx->getOption('site_name')} - имя сайта
	{$modx->getOption('site_start')} - id главной страницы
	{$modx->getOption('cultureKey')} - язык
#=== OPTIONS ===============================================================================#
#=== MIGX ==================================================================================#
#=== MIGX ==================================================================================#



Получить урл
{$modx->makeUrl(3)}
{url(3)}


Редирект
{redirect(3)} - редирект к id = 3
{redirect('about.html')} редирект к about.html
Редирект с учётом контекста
$options = ['context'=>'en']
redirect(3, $options);
или
redirect(3, 'en');


{forward(3)} перенаправляет запрос на другой ресурс без изменения URL-адреса


Перенаправление на ошибку или несанкционированную страницу.
{abort(401)}
{abort(403)}
{abort(404)}


получает все идентификаторы родительских ресурсов. (возвращает массив)
{$modx->getParentIds(3)} - для конкретного ресурса
{$modx->getParentIds($modx->resource->get('id'))} - для текущего ресурса


{$modx->getChildIds()} или {children()} - получает все идентификаторы дочерних ресурсов для данного ресурса.
{$modx->getChildIds(2)} или {children(2)} - получает все идентификаторы дочерних ресурсов для конкретного ресурса.








{$thumb = $modx->runSnippet('phpthumbof', [
	"input" => $image,
	"options" => "w=100&h=100&zc=1"
])}



